results_stress_1000.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 3m0s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 2m30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 0008/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 0008/1000 VUs  0m00.9s/2m30.0s

running (0m01.9s), 0016/1000 VUs, 8 complete and 0 interrupted iterations
default   [   1% ] 0016/1000 VUs  0m01.9s/2m30.0s

running (0m02.9s), 0025/1000 VUs, 21 complete and 0 interrupted iterations
default   [   2% ] 0025/1000 VUs  0m02.9s/2m30.0s

running (0m03.9s), 0033/1000 VUs, 35 complete and 0 interrupted iterations
default   [   3% ] 0033/1000 VUs  0m03.9s/2m30.0s

running (0m04.9s), 0041/1000 VUs, 49 complete and 0 interrupted iterations
default   [   3% ] 0041/1000 VUs  0m04.9s/2m30.0s

running (0m05.9s), 0050/1000 VUs, 64 complete and 0 interrupted iterations
default   [   4% ] 0050/1000 VUs  0m05.9s/2m30.0s

running (0m06.9s), 0058/1000 VUs, 79 complete and 0 interrupted iterations
default   [   5% ] 0058/1000 VUs  0m06.9s/2m30.0s

running (0m07.9s), 0066/1000 VUs, 93 complete and 0 interrupted iterations
default   [   5% ] 0066/1000 VUs  0m07.9s/2m30.0s

running (0m08.9s), 0075/1000 VUs, 108 complete and 0 interrupted iterations
default   [   6% ] 0075/1000 VUs  0m08.9s/2m30.0s

running (0m09.9s), 0083/1000 VUs, 122 complete and 0 interrupted iterations
default   [   7% ] 0083/1000 VUs  0m09.9s/2m30.0s

running (0m10.9s), 0091/1000 VUs, 137 complete and 0 interrupted iterations
default   [   7% ] 0091/1000 VUs  0m10.9s/2m30.0s

running (0m11.9s), 0100/1000 VUs, 152 complete and 0 interrupted iterations
default   [   8% ] 0100/1000 VUs  0m11.9s/2m30.0s

running (0m12.9s), 0108/1000 VUs, 166 complete and 0 interrupted iterations
default   [   9% ] 0108/1000 VUs  0m12.9s/2m30.0s

running (0m13.9s), 0116/1000 VUs, 181 complete and 0 interrupted iterations
default   [   9% ] 0116/1000 VUs  0m13.9s/2m30.0s

running (0m14.9s), 0125/1000 VUs, 195 complete and 0 interrupted iterations
default   [  10% ] 0125/1000 VUs  0m14.9s/2m30.0s

running (0m15.9s), 0133/1000 VUs, 210 complete and 0 interrupted iterations
default   [  11% ] 0133/1000 VUs  0m15.9s/2m30.0s

running (0m16.9s), 0141/1000 VUs, 225 complete and 0 interrupted iterations
default   [  11% ] 0141/1000 VUs  0m16.9s/2m30.0s

running (0m17.9s), 0150/1000 VUs, 239 complete and 0 interrupted iterations
default   [  12% ] 0150/1000 VUs  0m17.9s/2m30.0s

running (0m18.9s), 0158/1000 VUs, 254 complete and 0 interrupted iterations
default   [  13% ] 0158/1000 VUs  0m18.9s/2m30.0s

running (0m19.9s), 0166/1000 VUs, 268 complete and 0 interrupted iterations
default   [  13% ] 0166/1000 VUs  0m19.9s/2m30.0s

running (0m20.9s), 0175/1000 VUs, 283 complete and 0 interrupted iterations
default   [  14% ] 0175/1000 VUs  0m20.9s/2m30.0s

running (0m21.9s), 0183/1000 VUs, 298 complete and 0 interrupted iterations
default   [  15% ] 0183/1000 VUs  0m21.9s/2m30.0s

running (0m22.9s), 0191/1000 VUs, 312 complete and 0 interrupted iterations
default   [  15% ] 0191/1000 VUs  0m22.9s/2m30.0s

running (0m23.9s), 0200/1000 VUs, 327 complete and 0 interrupted iterations
default   [  16% ] 0200/1000 VUs  0m23.9s/2m30.0s

running (0m24.9s), 0208/1000 VUs, 342 complete and 0 interrupted iterations
default   [  17% ] 0208/1000 VUs  0m24.9s/2m30.0s

running (0m25.9s), 0216/1000 VUs, 356 complete and 0 interrupted iterations
default   [  17% ] 0216/1000 VUs  0m25.9s/2m30.0s

running (0m26.9s), 0225/1000 VUs, 371 complete and 0 interrupted iterations
default   [  18% ] 0225/1000 VUs  0m26.9s/2m30.0s

running (0m27.9s), 0233/1000 VUs, 385 complete and 0 interrupted iterations
default   [  19% ] 0233/1000 VUs  0m27.9s/2m30.0s

running (0m28.9s), 0241/1000 VUs, 400 complete and 0 interrupted iterations
default   [  19% ] 0241/1000 VUs  0m28.9s/2m30.0s

running (0m29.9s), 0250/1000 VUs, 415 complete and 0 interrupted iterations
default   [  20% ] 0250/1000 VUs  0m29.9s/2m30.0s

running (0m30.9s), 0258/1000 VUs, 429 complete and 0 interrupted iterations
default   [  21% ] 0258/1000 VUs  0m30.9s/2m30.0s

running (0m31.9s), 0266/1000 VUs, 444 complete and 0 interrupted iterations
default   [  21% ] 0266/1000 VUs  0m31.9s/2m30.0s

running (0m32.9s), 0275/1000 VUs, 458 complete and 0 interrupted iterations
default   [  22% ] 0275/1000 VUs  0m32.9s/2m30.0s

running (0m33.9s), 0283/1000 VUs, 473 complete and 0 interrupted iterations
default   [  23% ] 0283/1000 VUs  0m33.9s/2m30.0s

running (0m34.9s), 0291/1000 VUs, 488 complete and 0 interrupted iterations
default   [  23% ] 0291/1000 VUs  0m34.9s/2m30.0s

running (0m35.9s), 0300/1000 VUs, 502 complete and 0 interrupted iterations
default   [  24% ] 0300/1000 VUs  0m35.9s/2m30.0s

running (0m36.9s), 0308/1000 VUs, 517 complete and 0 interrupted iterations
default   [  25% ] 0308/1000 VUs  0m36.9s/2m30.0s

running (0m37.9s), 0316/1000 VUs, 532 complete and 0 interrupted iterations
default   [  25% ] 0316/1000 VUs  0m37.9s/2m30.0s

running (0m38.9s), 0324/1000 VUs, 546 complete and 0 interrupted iterations
default   [  26% ] 0324/1000 VUs  0m38.9s/2m30.0s

running (0m39.9s), 0333/1000 VUs, 567 complete and 0 interrupted iterations
default   [  27% ] 0333/1000 VUs  0m39.9s/2m30.0s

running (0m40.9s), 0341/1000 VUs, 589 complete and 0 interrupted iterations
default   [  27% ] 0341/1000 VUs  0m40.9s/2m30.0s

running (0m41.9s), 0349/1000 VUs, 612 complete and 0 interrupted iterations
default   [  28% ] 0349/1000 VUs  0m41.9s/2m30.0s

running (0m42.9s), 0358/1000 VUs, 633 complete and 0 interrupted iterations
default   [  29% ] 0358/1000 VUs  0m42.9s/2m30.0s

running (0m43.9s), 0366/1000 VUs, 656 complete and 0 interrupted iterations
default   [  29% ] 0366/1000 VUs  0m43.9s/2m30.0s

running (0m44.9s), 0374/1000 VUs, 678 complete and 0 interrupted iterations
default   [  30% ] 0374/1000 VUs  0m44.9s/2m30.0s

running (0m45.9s), 0383/1000 VUs, 700 complete and 0 interrupted iterations
default   [  31% ] 0383/1000 VUs  0m45.9s/2m30.0s

running (0m46.9s), 0391/1000 VUs, 722 complete and 0 interrupted iterations
default   [  31% ] 0391/1000 VUs  0m46.9s/2m30.0s

running (0m47.9s), 0399/1000 VUs, 744 complete and 0 interrupted iterations
default   [  32% ] 0399/1000 VUs  0m47.9s/2m30.0s

running (0m48.9s), 0408/1000 VUs, 766 complete and 0 interrupted iterations
default   [  33% ] 0408/1000 VUs  0m48.9s/2m30.0s

running (0m49.9s), 0416/1000 VUs, 789 complete and 0 interrupted iterations
default   [  33% ] 0416/1000 VUs  0m49.9s/2m30.0s

running (0m50.9s), 0424/1000 VUs, 812 complete and 0 interrupted iterations
default   [  34% ] 0424/1000 VUs  0m50.9s/2m30.0s

running (0m51.9s), 0433/1000 VUs, 834 complete and 0 interrupted iterations
default   [  35% ] 0433/1000 VUs  0m51.9s/2m30.0s

running (0m52.9s), 0441/1000 VUs, 858 complete and 0 interrupted iterations
default   [  35% ] 0441/1000 VUs  0m52.9s/2m30.0s

running (0m53.9s), 0449/1000 VUs, 880 complete and 0 interrupted iterations
default   [  36% ] 0449/1000 VUs  0m53.9s/2m30.0s

running (0m54.9s), 0458/1000 VUs, 902 complete and 0 interrupted iterations
default   [  37% ] 0458/1000 VUs  0m54.9s/2m30.0s

running (0m55.9s), 0466/1000 VUs, 924 complete and 0 interrupted iterations
default   [  37% ] 0466/1000 VUs  0m55.9s/2m30.0s

running (0m56.9s), 0474/1000 VUs, 946 complete and 0 interrupted iterations
default   [  38% ] 0474/1000 VUs  0m56.9s/2m30.0s

running (0m57.9s), 0483/1000 VUs, 969 complete and 0 interrupted iterations
default   [  39% ] 0483/1000 VUs  0m57.9s/2m30.0s

running (0m58.9s), 0491/1000 VUs, 997 complete and 0 interrupted iterations
default   [  39% ] 0491/1000 VUs  0m58.9s/2m30.0s

running (0m59.9s), 0499/1000 VUs, 1026 complete and 0 interrupted iterations
default   [  40% ] 0499/1000 VUs  0m59.9s/2m30.0s

running (1m00.9s), 0508/1000 VUs, 1058 complete and 0 interrupted iterations
default   [  41% ] 0508/1000 VUs  1m00.9s/2m30.0s

running (1m01.9s), 0516/1000 VUs, 1086 complete and 0 interrupted iterations
default   [  41% ] 0516/1000 VUs  1m01.9s/2m30.0s

running (1m02.9s), 0524/1000 VUs, 1116 complete and 0 interrupted iterations
default   [  42% ] 0524/1000 VUs  1m02.9s/2m30.0s

running (1m03.9s), 0533/1000 VUs, 1148 complete and 0 interrupted iterations
default   [  43% ] 0533/1000 VUs  1m03.9s/2m30.0s

running (1m04.9s), 0541/1000 VUs, 1175 complete and 0 interrupted iterations
default   [  43% ] 0541/1000 VUs  1m04.9s/2m30.0s

running (1m05.9s), 0549/1000 VUs, 1205 complete and 0 interrupted iterations
default   [  44% ] 0549/1000 VUs  1m05.9s/2m30.0s

running (1m06.9s), 0558/1000 VUs, 1236 complete and 0 interrupted iterations
default   [  45% ] 0558/1000 VUs  1m06.9s/2m30.0s

running (1m07.9s), 0566/1000 VUs, 1266 complete and 0 interrupted iterations
default   [  45% ] 0566/1000 VUs  1m07.9s/2m30.0s

running (1m08.9s), 0574/1000 VUs, 1304 complete and 0 interrupted iterations
default   [  46% ] 0574/1000 VUs  1m08.9s/2m30.0s

running (1m09.9s), 0583/1000 VUs, 1345 complete and 0 interrupted iterations
default   [  47% ] 0583/1000 VUs  1m09.9s/2m30.0s

running (1m10.9s), 0591/1000 VUs, 1383 complete and 0 interrupted iterations
default   [  47% ] 0591/1000 VUs  1m10.9s/2m30.0s

running (1m11.9s), 0599/1000 VUs, 1421 complete and 0 interrupted iterations
default   [  48% ] 0599/1000 VUs  1m11.9s/2m30.0s

running (1m12.9s), 0608/1000 VUs, 1460 complete and 0 interrupted iterations
default   [  49% ] 0608/1000 VUs  1m12.9s/2m30.0s

running (1m13.9s), 0616/1000 VUs, 1498 complete and 0 interrupted iterations
default   [  49% ] 0616/1000 VUs  1m13.9s/2m30.0s

running (1m14.9s), 0624/1000 VUs, 1536 complete and 0 interrupted iterations
default   [  50% ] 0624/1000 VUs  1m14.9s/2m30.0s

running (1m15.9s), 0633/1000 VUs, 1575 complete and 0 interrupted iterations
default   [  51% ] 0633/1000 VUs  1m15.9s/2m30.0s

running (1m16.9s), 0641/1000 VUs, 1614 complete and 0 interrupted iterations
default   [  51% ] 0641/1000 VUs  1m16.9s/2m30.0s

running (1m17.9s), 0649/1000 VUs, 1655 complete and 0 interrupted iterations
default   [  52% ] 0649/1000 VUs  1m17.9s/2m30.0s

running (1m18.9s), 0657/1000 VUs, 1700 complete and 0 interrupted iterations
default   [  53% ] 0657/1000 VUs  1m18.9s/2m30.0s

running (1m19.9s), 0666/1000 VUs, 1748 complete and 0 interrupted iterations
default   [  53% ] 0666/1000 VUs  1m19.9s/2m30.0s

running (1m20.9s), 0674/1000 VUs, 1793 complete and 0 interrupted iterations
default   [  54% ] 0674/1000 VUs  1m20.9s/2m30.0s

running (1m21.9s), 0682/1000 VUs, 1833 complete and 0 interrupted iterations
default   [  55% ] 0682/1000 VUs  1m21.9s/2m30.0s

running (1m22.9s), 0691/1000 VUs, 1873 complete and 0 interrupted iterations
default   [  55% ] 0691/1000 VUs  1m22.9s/2m30.0s

running (1m23.9s), 0699/1000 VUs, 1909 complete and 0 interrupted iterations
default   [  56% ] 0699/1000 VUs  1m23.9s/2m30.0s

running (1m24.9s), 0707/1000 VUs, 1947 complete and 0 interrupted iterations
default   [  57% ] 0707/1000 VUs  1m24.9s/2m30.0s

running (1m25.9s), 0716/1000 VUs, 1985 complete and 0 interrupted iterations
default   [  57% ] 0716/1000 VUs  1m25.9s/2m30.0s

running (1m26.9s), 0724/1000 VUs, 2024 complete and 0 interrupted iterations
default   [  58% ] 0724/1000 VUs  1m26.9s/2m30.0s

running (1m27.9s), 0732/1000 VUs, 2072 complete and 0 interrupted iterations
default   [  59% ] 0732/1000 VUs  1m27.9s/2m30.0s

running (1m28.9s), 0741/1000 VUs, 2121 complete and 0 interrupted iterations
default   [  59% ] 0741/1000 VUs  1m28.9s/2m30.0s

running (1m29.9s), 0749/1000 VUs, 2169 complete and 0 interrupted iterations
default   [  60% ] 0749/1000 VUs  1m29.9s/2m30.0s

running (1m30.9s), 0757/1000 VUs, 2215 complete and 0 interrupted iterations
default   [  61% ] 0757/1000 VUs  1m30.9s/2m30.0s

running (1m31.9s), 0766/1000 VUs, 2262 complete and 0 interrupted iterations
default   [  61% ] 0766/1000 VUs  1m31.9s/2m30.0s

running (1m32.9s), 0774/1000 VUs, 2308 complete and 0 interrupted iterations
default   [  62% ] 0774/1000 VUs  1m32.9s/2m30.0s

running (1m33.9s), 0782/1000 VUs, 2354 complete and 0 interrupted iterations
default   [  63% ] 0782/1000 VUs  1m33.9s/2m30.0s

running (1m34.9s), 0791/1000 VUs, 2399 complete and 0 interrupted iterations
default   [  63% ] 0791/1000 VUs  1m34.9s/2m30.0s

running (1m35.9s), 0799/1000 VUs, 2447 complete and 0 interrupted iterations
default   [  64% ] 0799/1000 VUs  1m35.9s/2m30.0s

running (1m36.9s), 0807/1000 VUs, 2496 complete and 0 interrupted iterations
default   [  65% ] 0807/1000 VUs  1m36.9s/2m30.0s

running (1m37.9s), 0816/1000 VUs, 2550 complete and 0 interrupted iterations
default   [  65% ] 0816/1000 VUs  1m37.9s/2m30.0s

running (1m38.9s), 0824/1000 VUs, 2603 complete and 0 interrupted iterations
default   [  66% ] 0824/1000 VUs  1m38.9s/2m30.0s

running (1m39.9s), 0832/1000 VUs, 2658 complete and 0 interrupted iterations
default   [  67% ] 0832/1000 VUs  1m39.9s/2m30.0s

running (1m40.9s), 0841/1000 VUs, 2708 complete and 0 interrupted iterations
default   [  67% ] 0841/1000 VUs  1m40.9s/2m30.0s

running (1m41.9s), 0849/1000 VUs, 2755 complete and 0 interrupted iterations
default   [  68% ] 0849/1000 VUs  1m41.9s/2m30.0s

running (1m42.9s), 0857/1000 VUs, 2801 complete and 0 interrupted iterations
default   [  69% ] 0857/1000 VUs  1m42.9s/2m30.0s

running (1m43.9s), 0866/1000 VUs, 2849 complete and 0 interrupted iterations
default   [  69% ] 0866/1000 VUs  1m43.9s/2m30.0s

running (1m44.9s), 0874/1000 VUs, 2894 complete and 0 interrupted iterations
default   [  70% ] 0874/1000 VUs  1m44.9s/2m30.0s

running (1m45.9s), 0882/1000 VUs, 2940 complete and 0 interrupted iterations
default   [  71% ] 0882/1000 VUs  1m45.9s/2m30.0s

running (1m46.9s), 0891/1000 VUs, 3000 complete and 0 interrupted iterations
default   [  71% ] 0891/1000 VUs  1m46.9s/2m30.0s

running (1m47.9s), 0899/1000 VUs, 3056 complete and 0 interrupted iterations
default   [  72% ] 0899/1000 VUs  1m47.9s/2m30.0s

running (1m48.9s), 0907/1000 VUs, 3112 complete and 0 interrupted iterations
default   [  73% ] 0907/1000 VUs  1m48.9s/2m30.0s

running (1m49.9s), 0916/1000 VUs, 3169 complete and 0 interrupted iterations
default   [  73% ] 0916/1000 VUs  1m49.9s/2m30.0s

running (1m50.9s), 0924/1000 VUs, 3220 complete and 0 interrupted iterations
default   [  74% ] 0924/1000 VUs  1m50.9s/2m30.0s

running (1m51.9s), 0932/1000 VUs, 3274 complete and 0 interrupted iterations
default   [  75% ] 0932/1000 VUs  1m51.9s/2m30.0s

running (1m52.9s), 0941/1000 VUs, 3330 complete and 0 interrupted iterations
default   [  75% ] 0941/1000 VUs  1m52.9s/2m30.0s

running (1m53.9s), 0949/1000 VUs, 3381 complete and 0 interrupted iterations
default   [  76% ] 0949/1000 VUs  1m53.9s/2m30.0s

running (1m54.9s), 0957/1000 VUs, 3438 complete and 0 interrupted iterations
default   [  77% ] 0957/1000 VUs  1m54.9s/2m30.0s

running (1m55.9s), 0966/1000 VUs, 3497 complete and 0 interrupted iterations
default   [  77% ] 0966/1000 VUs  1m55.9s/2m30.0s

running (1m56.9s), 0974/1000 VUs, 3559 complete and 0 interrupted iterations
default   [  78% ] 0974/1000 VUs  1m56.9s/2m30.0s

running (1m57.9s), 0982/1000 VUs, 3622 complete and 0 interrupted iterations
default   [  79% ] 0982/1000 VUs  1m57.9s/2m30.0s

running (1m58.9s), 0990/1000 VUs, 3683 complete and 0 interrupted iterations
default   [  79% ] 0990/1000 VUs  1m58.9s/2m30.0s

running (1m59.9s), 0999/1000 VUs, 3743 complete and 0 interrupted iterations
default   [  80% ] 0999/1000 VUs  1m59.9s/2m30.0s

running (2m00.9s), 1000/1000 VUs, 3800 complete and 0 interrupted iterations
default   [  81% ] 1000/1000 VUs  2m00.9s/2m30.0s

running (2m01.9s), 1000/1000 VUs, 3851 complete and 0 interrupted iterations
default   [  81% ] 1000/1000 VUs  2m01.9s/2m30.0s

running (2m02.9s), 1000/1000 VUs, 3909 complete and 0 interrupted iterations
default   [  82% ] 1000/1000 VUs  2m02.9s/2m30.0s

running (2m03.9s), 0999/1000 VUs, 3963 complete and 0 interrupted iterations
default   [  83% ] 0999/1000 VUs  2m03.9s/2m30.0s

running (2m04.9s), 0991/1000 VUs, 4016 complete and 0 interrupted iterations
default   [  83% ] 0991/1000 VUs  2m04.9s/2m30.0s

running (2m05.9s), 0983/1000 VUs, 4082 complete and 0 interrupted iterations
default   [  84% ] 0983/1000 VUs  2m05.9s/2m30.0s

running (2m06.9s), 0974/1000 VUs, 4149 complete and 0 interrupted iterations
default   [  85% ] 0974/1000 VUs  2m06.9s/2m30.0s

running (2m07.9s), 0964/1000 VUs, 4213 complete and 0 interrupted iterations
default   [  85% ] 0964/1000 VUs  2m07.9s/2m30.0s

running (2m08.9s), 0947/1000 VUs, 4276 complete and 0 interrupted iterations
default   [  86% ] 0947/1000 VUs  2m08.9s/2m30.0s

running (2m09.9s), 0930/1000 VUs, 4340 complete and 0 interrupted iterations
default   [  87% ] 0930/1000 VUs  2m09.9s/2m30.0s

running (2m10.9s), 0914/1000 VUs, 4400 complete and 0 interrupted iterations
default   [  87% ] 0914/1000 VUs  2m10.9s/2m30.0s

running (2m11.9s), 0894/1000 VUs, 4464 complete and 0 interrupted iterations
default   [  88% ] 0894/1000 VUs  2m11.9s/2m30.0s

running (2m12.9s), 0870/1000 VUs, 4527 complete and 0 interrupted iterations
default   [  89% ] 0870/1000 VUs  2m12.9s/2m30.0s

running (2m13.9s), 0846/1000 VUs, 4589 complete and 0 interrupted iterations
default   [  89% ] 0846/1000 VUs  2m13.9s/2m30.0s

running (2m14.9s), 0821/1000 VUs, 4656 complete and 0 interrupted iterations
default   [  90% ] 0821/1000 VUs  2m14.9s/2m30.0s

running (2m15.9s), 0791/1000 VUs, 4725 complete and 0 interrupted iterations
default   [  91% ] 0791/1000 VUs  2m15.9s/2m30.0s

running (2m16.9s), 0760/1000 VUs, 4797 complete and 0 interrupted iterations
default   [  91% ] 0760/1000 VUs  2m16.9s/2m30.0s

running (2m17.9s), 0726/1000 VUs, 4869 complete and 0 interrupted iterations
default   [  92% ] 0726/1000 VUs  2m17.9s/2m30.0s

running (2m18.9s), 0695/1000 VUs, 4935 complete and 0 interrupted iterations
default   [  93% ] 0695/1000 VUs  2m18.9s/2m30.0s

running (2m19.9s), 0661/1000 VUs, 4995 complete and 0 interrupted iterations
default   [  93% ] 0661/1000 VUs  2m19.9s/2m30.0s

running (2m20.9s), 0627/1000 VUs, 5050 complete and 0 interrupted iterations
default   [  94% ] 0627/1000 VUs  2m20.9s/2m30.0s

running (2m21.9s), 0594/1000 VUs, 5104 complete and 0 interrupted iterations
default   [  95% ] 0594/1000 VUs  2m21.9s/2m30.0s

running (2m22.9s), 0562/1000 VUs, 5158 complete and 0 interrupted iterations
default   [  95% ] 0562/1000 VUs  2m22.9s/2m30.0s

running (2m23.9s), 0531/1000 VUs, 5203 complete and 0 interrupted iterations
default   [  96% ] 0531/1000 VUs  2m23.9s/2m30.0s

running (2m24.9s), 0496/1000 VUs, 5259 complete and 0 interrupted iterations
default   [  97% ] 0496/1000 VUs  2m24.9s/2m30.0s

running (2m25.9s), 0460/1000 VUs, 5317 complete and 0 interrupted iterations
default   [  97% ] 0460/1000 VUs  2m25.9s/2m30.0s

running (2m26.9s), 0426/1000 VUs, 5375 complete and 0 interrupted iterations
default   [  98% ] 0426/1000 VUs  2m26.9s/2m30.0s

running (2m27.9s), 0397/1000 VUs, 5420 complete and 0 interrupted iterations
default   [  99% ] 0397/1000 VUs  2m27.9s/2m30.0s

running (2m28.9s), 0367/1000 VUs, 5465 complete and 0 interrupted iterations
default   [  99% ] 0367/1000 VUs  2m28.9s/2m30.0s

running (2m29.9s), 0328/1000 VUs, 5511 complete and 0 interrupted iterations
default   [ 100% ] 0328/1000 VUs  2m29.9s/2m30.0s

running (2m30.9s), 0284/1000 VUs, 5554 complete and 1 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m31.9s), 0245/1000 VUs, 5593 complete and 1 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m32.9s), 0204/1000 VUs, 5634 complete and 1 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m33.9s), 0172/1000 VUs, 5666 complete and 1 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m34.9s), 0143/1000 VUs, 5693 complete and 3 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m35.9s), 0117/1000 VUs, 5719 complete and 3 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m36.9s), 0101/1000 VUs, 5734 complete and 4 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m37.9s), 0085/1000 VUs, 5750 complete and 4 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m38.9s), 0082/1000 VUs, 5753 complete and 4 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m39.9s), 0081/1000 VUs, 5753 complete and 5 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m40.9s), 0081/1000 VUs, 5753 complete and 5 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m41.9s), 0077/1000 VUs, 5756 complete and 6 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m42.9s), 0064/1000 VUs, 5769 complete and 6 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m43.9s), 0049/1000 VUs, 5784 complete and 6 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m44.9s), 0035/1000 VUs, 5798 complete and 6 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m45.9s), 0020/1000 VUs, 5813 complete and 6 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s

running (2m46.9s), 0005/1000 VUs, 5828 complete and 6 interrupted iterations
default ↓ [ 100% ] 0326/1000 VUs  2m30s


  █ TOTAL RESULTS 

    checks_total.......: 5834   34.882566/s
    checks_succeeded...: 38.60% 2252 out of 5834
    checks_failed......: 61.39% 3582 out of 5834

    ✗ status is 200 or 201
      ↳  38% — ✓ 2252 / ✗ 3582

    HTTP
    http_req_duration..............: avg=13.5s  min=70.15ms med=18.03s max=1m0s   p(90)=18.04s p(95)=18.04s
      { expected_response:true }...: avg=3.61s  min=70.15ms med=2.06s  max=57.32s p(90)=5.11s  p(95)=5.13s 
    http_req_failed................: 61.39% 3582 out of 5834
    http_reqs......................: 5834   34.882566/s

    EXECUTION
    iteration_duration.............: avg=14.49s min=1.07s   med=19.03s max=1m1s   p(90)=19.04s p(95)=19.04s
    iterations.....................: 5833   34.876587/s
    vus............................: 5      min=5            max=1000
    vus_max........................: 1000   min=1000         max=1000

    NETWORK
    data_received..................: 707 kB 4.2 kB/s
    data_sent......................: 2.2 MB 13 kB/s



running (2m47.2s), 0000/1000 VUs, 5833 complete and 6 interrupted iterations
default ✓ [ 100% ] 0000/1000 VUs  2m30s